/**
 * 繁体中文语言包
 */
import type { LocaleData } from '../types.js';

export const zhHant: LocaleData = {
  monthNames: {
    '0': '1 月', '1': '2 月', '2': '3 月', '3': '4 月',
    '4': '5 月', '5': '6 月', '6': '7 月', '7': '8 月',
    '8': '9 月', '9': '10 月', '10': '11 月', '11': '12 月'
  },
  weeks: {
    '0': '星期日', '1': '星期一', '2': '星期二', '3': '星期三',
    '4': '星期四', '5': '星期五', '6': '星期六'
  },
  heavens: {
    '0': '甲', '1': '乙', '2': '丙', '3': '丁', '4': '戊',
    '5': '己', '6': '庚', '7': '辛', '8': '壬', '9': '癸'
  },
  earths: {
    '0': '子', '1': '丑', '2': '寅', '3': '卯', '4': '辰', '5': '巳',
    '6': '午', '7': '未', '8': '申', '9': '酉', '10': '戌', '11': '亥'
  },
  animals: {
    '0': '鼠', '1': '牛', '2': '虎', '3': '兔', '4': '龍', '5': '蛇',
    '6': '馬', '7': '羊', '8': '猴', '9': '雞', '10': '狗', '11': '豬'
  },
  monthNumbers: {
    '-1': '一', '0': '正', '1': '二', '2': '三', '3': '四', '4': '五',
    '5': '六', '6': '七', '7': '八', '8': '九', '9': '十', '10': '十一', '11': '十二'
  },
  dayNumbers: {
    '0': '初一', '1': '初二', '2': '初三', '3': '初四', '4': '初五',
    '5': '初六', '6': '初七', '7': '初八', '8': '初九', '9': '初十',
    '10': '十一', '11': '十二', '12': '十三', '13': '十四', '14': '十五',
    '15': '十六', '16': '十七', '17': '十八', '18': '十九', '19': '二十',
    '20': '廿一', '21': '廿二', '22': '廿三', '23': '廿四', '24': '廿五',
    '25': '廿六', '26': '廿七', '27': '廿八', '28': '廿九', '29': '三十'
  },
  moonStatuses: {
    '0': '朔', '1': '上弦', '2': '望', '3': '下弦'
  },
  monthSizes: {
    '0': '小', '1': '大'
  },
  soltermNames: {
    '0': '小寒', '1': '大寒', '2': '立春', '3': '雨水', '4': '驚蟄', '5': '春分',
    '6': '清明', '7': '穀雨', '8': '立夏', '9': '小滿', '10': '芒種', '11': '夏至',
    '12': '小暑', '13': '大暑', '14': '立秋', '15': '處暑', '16': '白露', '17': '秋分',
    '18': '寒露', '19': '霜降', '20': '立冬', '21': '小雪', '22': '大雪', '23': '冬至',
    '24': '小寒'
  },
  eclipseNames: {
    '0': '日偏食', '1': '日環食', '2': '日全食', '3': '日全環食',
    '4': '半影月食', '5': '月偏食', '6': '月全食'
  },
  leap: {
    'leap': '閏', 'post': '後', 'post9': '後九'
  },
  years: {
    'ce': '{{year}}', 'bce': '前{{year}}'
  },
  yearExpressions: {
    'short': '{{year}}年',
    'short.ganZhi': '{{heaven}}{{earth}}年',
    'normal': '{{year}}（{{shengxiao}}）年',
    'normal.ganZhi': '{{heaven}}{{earth}}（{{shengxiao}}）年',
    'full': '{{year}}（{{heaven}}{{earth}}，{{shengxiao}}）年'
  },
  monthExpressions: {
    'short': '{{month}}月',
    'short.ganZhi': '{{heaven}}{{earth}}月',
    'normal': '{{month}}月{{size}}',
    'normal.ganZhi': '{{heaven}}{{earth}}月{{size}}',
    'full': '{{month}}月{{size}}（建{{heaven}}{{earth}}）',
    'full.noZhong': '{{month}}月{{size}}（無中氣）'
  },
  dayExpressions: {
    'short': '{{day}}',
    'short.ganZhi': '{{heaven}}{{earth}}',
    'normal': '{{day}}',
    'normal.ganZhi': '{{heaven}}{{earth}}',
    'full': '{{day}} ({{heaven}}{{earth}})'
  },
  dateExpressions: {
    'normal': '{{month}}{{day}}',
    'full': '{{year}}{{month}}{{day}}'
  },
  westernCalendar: {
    'early': '逆推儒略曆',
    '7': '儒略曆',
    '1582': '儒略曆/格里曆',
    'now': '格里曆'
  },
  yearInfos: {
    'qinEarlyHan': '秦朝及漢初(公元前221年 &ndash; 前104年)的曆法沿用顓頊曆的月序。',
    'xin': '公元9年，王莽建立新朝，改正朔以殷正建丑(即現在的十二月)為年首。',
    'xin24': '<br />地皇四年和更始元年有十一個月重疊。',
    'wei': '魏青龍五年（丁巳年，公元237年），魏明帝改正朔。',
    'wuZhou': '公元689年12月，武則天改正朔，以周正建子(即現在的十一月)為年首。',
    'tang': '公元761年12月，唐肅宗改正朔，以周正建子(即現在的十一月)為年首。',
    'gCalenderReform': '格里高里曆改:公曆在10月4日及之前用儒略曆，之後用格里高里曆。為使春分的日期回復到3月21日(公元325年時的春分日期)，10月4日的下一日改為10月15日，跳了10日。',
    'qing': '康熙六年至八年清政府因曆獄廢除西洋新法，復用明朝《大統曆》，二十四節氣改回平氣。'
  },
  notes: {
    'early': '朔的時刻接近午夜零時，初一或會提早一天。',
    'later': '朔的時刻接近午夜零時，初一或會推遲一天。',
    '1914': '',
    '1929': ''
  },
  htmlLabels: {
    'moonPhases': '月相',
    'solarTerms': '24節氣',
    'calSolTermsPingqi': '曆書節氣(平氣)',
    'calSolTermsDingqi': '曆書節氣(定氣)',
    'xinfa': '新法節氣(定氣)',
    'datong': '大統曆節氣(平氣)',
    'yearLabel': '公曆年',
    'lunarYearLabel': '農曆年'
  },
  yearHtmls: {
    'gregorian': '<h1>{{yearLabel}}（{{gcal}}）: {{yearc}}</h1>',
    'lunarOne': '<h1>{{lunarLabel}}:</h1><h2>{{name0}}</h2><br/>',
    'lunarTwo': '<h1>{{lunarLabel}}:</h1><h2>{{month0}}{{day0}}日前: {{name0}},<br/>{{month0}}{{day0}}日及以后：{{name1}}</h2><br/>',
    'lunarThree': '<h1>{{lunarLabel}}:</h1><h2>{{month0}}{{day0}}日前: {{name0}},<br/>{{month0}}{{day0}}日至{{month1}}{{day1l}}日: {{name1}},<br/>{{month1}}{{day1}}日及以后: {{name2}}</h2><br/>',
    'lunar24': '<h1>{{lunarLabel}}:</h1><h2>{{month0}}{{day0}}日前: 癸未(羊)漢更始元年,<br/>{{month0}}{{day0}}日及以后：{{name1}}</h2><br/>'
  }
};
